jahnavinanduri10/microcontrollers_stm32/07_HAL_GPIO_interrupt/Src/main.c
#include <stdio.h>
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_gpio.h"
#include "uart.h"
#include "adc.h"

#define BTN_PORT    GPIOA
#define BTN_PIN    GPIO_PIN_0
#define LED_PORT    GPIOD
#define LED_PIN     GPIO_PIN_13

void gpio_pa0_interrupt_init(void);

int main(void)
{
	HAL_Init();
	gpio_pa0_interrupt_init();

 while(1)
 {

 }

}

void SysTick_Handler(void)
{
	HAL_IncTick();
}

void gpio_pa0_interrupt_init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct = {0};
	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_SYSCFG_CLK_ENABLE();
	__HAL_RCC_GPIOD_CLK_ENABLE();

	// configure PA0
	GPIO_InitStruct.Pin = GPIO_PIN_0;
	GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;

	HAL_GPIO_Init(BTN_PORT,&GPIO_InitStruct);

	// configure PD13
	GPIO_InitStruct.Pin = LED_PIN;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;

	HAL_GPIO_Init(LED_PORT,&GPIO_InitStruct);

	// configure EXTI
	HAL_NVIC_SetPriority(EXTI0_IRQn,0,0);
	HAL_NVIC_EnableIRQ(EXTI0_IRQn);

}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	HAL_GPIO_TogglePin(LED_PORT,LED_PIN);
}

void EXTI0_IRQHandler(void)
{
	HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_0);
}
